app/Controllers/PortfolioController.php

    public function update($id = null)
    {
        // Check if user is logged in
        $userId = session()->get('user_id');
        $userRole = session()->get('user_role');

        if (!$userId) {
            return $this->failUnauthorized('You must be logged in.');
        }

        // Get ID from POST data if not in URL
        $portfolioId = $id ?? $this->request->getPost('id');
        if (!$portfolioId) {
            return $this->fail('Portfolio ID is required.');
        }

        // Check Portfolio exists
        $portfolio = $this->portfolioModel->find($portfolioId);
---
SELECT *
FROM `portfolios`
WHERE `portfolios`.`id` = '1'