app/Controllers/ProjectController.php

SELECT *
FROM `projects`
WHERE `projects`.`id` = '13'
DELETE FROM `projects`
WHERE `id` IN ('12')
---
    public function delete($id = null){
        $userId = session()->get('user_id');
        $userRole = session()->get('user_role');

        // Check Project exists
        $project = $this->projectModel->find($this->request->getPost('id'));
        if (!$project) {
            return $this->failNotFound('Project not found.');
        }

        // Check if the logged-in user is the creator or an admin
        $creatorId = $project['creator_id'] ?? null;
        if ($creatorId != $userId && $userRole !== 'admin') {
            return $this->failUnauthorized('You are not authorized to delete this project.');
        }

        // Delete the project
        if ($this->projectModel->delete($this->request->getPost('id'))) {

SELECT *
FROM `projects`
WHERE `projects`.`id` = '12'
---
    public function update($id = null){
        $userId = session()->get('user_id');
        $userRole = session()->get('user_role');


        // Check Project exists
        $project = $this->projectModel->find($this->request->getPost('id'));

SELECT *
FROM `projects`
---
    public function findAllProjects(){
        $projects = $this->projectModel->findAllProjects();

SELECT *
FROM `projects`
WHERE `projects`.`id` = '13'
---
    public function findProjectById($id = null){
        $project = $this->projectModel->find($this->request->getPost('id'));