app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function profile(){
        // Get user data from session
        $userId = session()->get('user_id');  // Retrieve user ID from session

        if (!$userId) {
            // If there's no user ID in the session, the user is not logged in
            return $this->failUnauthorized('You must be logged in to access this resource');
        }

        // Fetch user details from the database based on the session data
        $user = $this->userModel->asObject()->find($userId);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function findNameById()
    {
        $id = $this->request->getPost('id');
        $user = $this->userModel->find($id);