app/Models/PortfolioModel.php

    public function createPortfolio($data){
        if ($this->save($data)) {
            return $this->insertID;
---
INSERT INTO `portfolios` (`creator_id`, `title`, `description`, `category`, `file_path`, `rating_count`, `rating_average`, `created_at`, `updated_at`) VALUES ('2', 'Logo Design 1', 'deskripsi logo design 1', 'logo', 'uploads/portfolios/1736130440_88910cca474050ed836d.png', 0, 0, '2025-01-06 02:27:20', '2025-01-06 02:27:20')

    public function findAllPortfolios(){
        return $this->findAll();
---
SELECT *
FROM `portfolios`

    public function findByCreator($creatorName)
    {
        return $this->db->table('portfolios p')
            ->select('p.*, u.name as creator_name')
            ->join('users u', 'u.id = p.creator_id')
            ->like('u.name', $creatorName)
            ->get()
            ->getResultArray();
---
SELECT `p`.*, `u`.`name` as `creator_name`
FROM `portfolios` `p`
JOIN `users` `u` ON `u`.`id` = `p`.`creator_id`
WHERE `u`.`name` LIKE '%john doe%' ESCAPE '!'

    public function findByCategory($category)
    {
        // Debug query
        $result = $this->where('category', $category)->findAll();
---
SELECT *
FROM `portfolios`
WHERE `category` = 'logo'