app/Models/ProjectModel.php

INSERT INTO `projects` (`creator_id`, `client_id`, `title`, `description`, `category`, `status`, `deadline`, `created_at`, `updated_at`) VALUES ('5', '4', 'project21', 'description of project1', 'video', 'pending', '2025-01-01', '2025-01-05 19:49:36', '2025-01-05 19:49:36')
---
    public function createProject($data){
        if ($this->save($data)) {
            return $this->insertID; // Return the inserted ID if successful

SELECT *
FROM `projects`
---
    public function findAllProjects(){
        return $this->findAll();