app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'john@example.com'
 LIMIT 1
---
    public function getUserByEmail($email){
        return $this->where('email', $email)->asObject()->first();

INSERT INTO `users` (`name`, `email`, `password`, `role`) VALUES ('jane doe', 'jane@example.com', '$2y$10$aHM9mA8jh5CPR2IUaNQAbem1I6igRrKLI5ejZwwy7O6RrKigFgJQa', 'client')
---
    public function createUser($data){
        return $this->insert($data);